temple-os theme requires the font from [[https://github.com/rendello/templeos_font][temple-font]] it also requires the autothemer package.  Its the first draft of the theme so their may be color discrepancies 

** All the icons
   #+begin_src emacs-lisp


     (use-package all-the-icons
       :straight t
       :if (display-graphic-p))

   #+end_src

#+begin_src C

  printf("Hello my name is malcolm" );

#+end_src

#+RESULTS:
: Hello my name is malcolm

